Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcr.h
/*
 * Component description for FCR
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:39Z  */
#ifndef _PIC32CMGC00_FCR_COMPONENT_H_
#define _PIC32CMGC00_FCR_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR FCR                       */
/* ************************************************************************** */

/* -------- FCR_CTRLA : (FCR Offset: 0x00) (R/W 32) CTRL A REGISTER -------- */
#define FCR_CTRLA_RESETVALUE                  _UINT32_(0x8000)                                     /*  (FCR_CTRLA) CTRL A REGISTER  Reset Value */

#define FCR_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (FCR_CTRLA) Privileged Access Only Position */
#define FCR_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << FCR_CTRLA_PRIV_Pos)                /* (FCR_CTRLA) Privileged Access Only Mask */
#define FCR_CTRLA_PRIV(value)                 (FCR_CTRLA_PRIV_Msk & (_UINT32_(value) << FCR_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the FCR_CTRLA register */
#define   FCR_CTRLA_PRIV_DISABLE_Val          _UINT32_(0x0)                                        /* (FCR_CTRLA) Macro register accessible in privileged and unprivileged accesses.  */
#define   FCR_CTRLA_PRIV_ENABLE_Val           _UINT32_(0x1)                                        /* (FCR_CTRLA) Macro registers only accessible in privileged accesses  */
#define FCR_CTRLA_PRIV_DISABLE                (FCR_CTRLA_PRIV_DISABLE_Val << FCR_CTRLA_PRIV_Pos)   /* (FCR_CTRLA) Macro register accessible in privileged and unprivileged accesses. Position */
#define FCR_CTRLA_PRIV_ENABLE                 (FCR_CTRLA_PRIV_ENABLE_Val << FCR_CTRLA_PRIV_Pos)    /* (FCR_CTRLA) Macro registers only accessible in privileged accesses Position */
#define FCR_CTRLA_FWS_Pos                     _UINT32_(8)                                          /* (FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Position */
#define FCR_CTRLA_FWS_Msk                     (_UINT32_(0xF) << FCR_CTRLA_FWS_Pos)                 /* (FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Mask */
#define FCR_CTRLA_FWS(value)                  (FCR_CTRLA_FWS_Msk & (_UINT32_(value) << FCR_CTRLA_FWS_Pos)) /* Assignment of value for FWS in the FCR_CTRLA register */
#define   FCR_CTRLA_FWS_0_Val                 _UINT32_(0x0)                                        /* (FCR_CTRLA) Zero Wait States  */
#define   FCR_CTRLA_FWS_1_Val                 _UINT32_(0x1)                                        /* (FCR_CTRLA) One Wait State  */
#define   FCR_CTRLA_FWS_14_Val                _UINT32_(0xE)                                        /* (FCR_CTRLA) Fourteen Wait States  */
#define   FCR_CTRLA_FWS_15_Val                _UINT32_(0xF)                                        /* (FCR_CTRLA) Fifteen Wait States  */
#define FCR_CTRLA_FWS_0                       (FCR_CTRLA_FWS_0_Val << FCR_CTRLA_FWS_Pos)           /* (FCR_CTRLA) Zero Wait States Position */
#define FCR_CTRLA_FWS_1                       (FCR_CTRLA_FWS_1_Val << FCR_CTRLA_FWS_Pos)           /* (FCR_CTRLA) One Wait State Position */
#define FCR_CTRLA_FWS_14                      (FCR_CTRLA_FWS_14_Val << FCR_CTRLA_FWS_Pos)          /* (FCR_CTRLA) Fourteen Wait States Position */
#define FCR_CTRLA_FWS_15                      (FCR_CTRLA_FWS_15_Val << FCR_CTRLA_FWS_Pos)          /* (FCR_CTRLA) Fifteen Wait States Position */
#define FCR_CTRLA_ADRWS_Pos                   _UINT32_(14)                                         /* (FCR_CTRLA) Address Wait State Enable Position */
#define FCR_CTRLA_ADRWS_Msk                   (_UINT32_(0x1) << FCR_CTRLA_ADRWS_Pos)               /* (FCR_CTRLA) Address Wait State Enable Mask */
#define FCR_CTRLA_ADRWS(value)                (FCR_CTRLA_ADRWS_Msk & (_UINT32_(value) << FCR_CTRLA_ADRWS_Pos)) /* Assignment of value for ADRWS in the FCR_CTRLA register */
#define   FCR_CTRLA_ADRWS_ZERO_Val            _UINT32_(0x0)                                        /* (FCR_CTRLA) Add 0 Address Wait States - allowing for higher performance at lower clock frequencies  */
#define   FCR_CTRLA_ADRWS_ONE_Val             _UINT32_(0x1)                                        /* (FCR_CTRLA) Add 1 Address Wait State - allowing for higher clock frequencies  */
#define FCR_CTRLA_ADRWS_ZERO                  (FCR_CTRLA_ADRWS_ZERO_Val << FCR_CTRLA_ADRWS_Pos)    /* (FCR_CTRLA) Add 0 Address Wait States - allowing for higher performance at lower clock frequencies Position */
#define FCR_CTRLA_ADRWS_ONE                   (FCR_CTRLA_ADRWS_ONE_Val << FCR_CTRLA_ADRWS_Pos)     /* (FCR_CTRLA) Add 1 Address Wait State - allowing for higher clock frequencies Position */
#define FCR_CTRLA_AUTOWS_Pos                  _UINT32_(15)                                         /* (FCR_CTRLA) Automatic Wait State Enable. Position */
#define FCR_CTRLA_AUTOWS_Msk                  (_UINT32_(0x1) << FCR_CTRLA_AUTOWS_Pos)              /* (FCR_CTRLA) Automatic Wait State Enable. Mask */
#define FCR_CTRLA_AUTOWS(value)               (FCR_CTRLA_AUTOWS_Msk & (_UINT32_(value) << FCR_CTRLA_AUTOWS_Pos)) /* Assignment of value for AUTOWS in the FCR_CTRLA register */
#define   FCR_CTRLA_AUTOWS_DISABLE_Val        _UINT32_(0x0)                                        /* (FCR_CTRLA) Use FWS: Total flash wait states are ADRWS + FWS  */
#define   FCR_CTRLA_AUTOWS_ENABLE_Val         _UINT32_(0x1)                                        /* (FCR_CTRLA) Use Automatic wait states: Total flash wait states are ADRWS + Taws  */
#define FCR_CTRLA_AUTOWS_DISABLE              (FCR_CTRLA_AUTOWS_DISABLE_Val << FCR_CTRLA_AUTOWS_Pos) /* (FCR_CTRLA) Use FWS: Total flash wait states are ADRWS + FWS Position */
#define FCR_CTRLA_AUTOWS_ENABLE               (FCR_CTRLA_AUTOWS_ENABLE_Val << FCR_CTRLA_AUTOWS_Pos) /* (FCR_CTRLA) Use Automatic wait states: Total flash wait states are ADRWS + Taws Position */
#define FCR_CTRLA_RDBUFWS_Pos                 _UINT32_(16)                                         /* (FCR_CTRLA) Read Buffer Wait StatesPer AHB port control of deterministic or zero wait state read buffer access. Position */
#define FCR_CTRLA_RDBUFWS_Msk                 (_UINT32_(0x1) << FCR_CTRLA_RDBUFWS_Pos)             /* (FCR_CTRLA) Read Buffer Wait StatesPer AHB port control of deterministic or zero wait state read buffer access. Mask */
#define FCR_CTRLA_RDBUFWS(value)              (FCR_CTRLA_RDBUFWS_Msk & (_UINT32_(value) << FCR_CTRLA_RDBUFWS_Pos)) /* Assignment of value for RDBUFWS in the FCR_CTRLA register */
#define   FCR_CTRLA_RDBUFWS_ZEROWS_Val        _UINT32_(0x0)                                        /* (FCR_CTRLA) 0 Wait States  */
#define   FCR_CTRLA_RDBUFWS_DETERMINISTIC_Val _UINT32_(0x1)                                        /* (FCR_CTRLA) ADRWS + FWS wait state for hits to AHB read buffer  */
#define FCR_CTRLA_RDBUFWS_ZEROWS              (FCR_CTRLA_RDBUFWS_ZEROWS_Val << FCR_CTRLA_RDBUFWS_Pos) /* (FCR_CTRLA) 0 Wait States Position */
#define FCR_CTRLA_RDBUFWS_DETERMINISTIC       (FCR_CTRLA_RDBUFWS_DETERMINISTIC_Val << FCR_CTRLA_RDBUFWS_Pos) /* (FCR_CTRLA) ADRWS + FWS wait state for hits to AHB read buffer Position */
#define FCR_CTRLA_Msk                         _UINT32_(0x0001CF04)                                 /* (FCR_CTRLA) Register Mask  */


/* -------- FCR_CTRLB : (FCR Offset: 0x04) (R/W 32) CTRL B REGISTER -------- */
#define FCR_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCR_CTRLB) CTRL B REGISTER  Reset Value */

#define FCR_CTRLB_PRM_Pos                     _UINT32_(0)                                          /* (FCR_CTRLB) Set NVM Power Reduction Mode Position */
#define FCR_CTRLB_PRM_Msk                     (_UINT32_(0x1) << FCR_CTRLB_PRM_Pos)                 /* (FCR_CTRLB) Set NVM Power Reduction Mode Mask */
#define FCR_CTRLB_PRM(value)                  (FCR_CTRLB_PRM_Msk & (_UINT32_(value) << FCR_CTRLB_PRM_Pos)) /* Assignment of value for PRM in the FCR_CTRLB register */
#define   FCR_CTRLB_PRM_NONE_Val              _UINT32_(0x0)                                        /* (FCR_CTRLB) No Action  */
#define   FCR_CTRLB_PRM_TOGGLE_Val            _UINT32_(0x1)                                        /* (FCR_CTRLB) Toggle the Flash Power Mode  */
#define FCR_CTRLB_PRM_NONE                    (FCR_CTRLB_PRM_NONE_Val << FCR_CTRLB_PRM_Pos)        /* (FCR_CTRLB) No Action Position */
#define FCR_CTRLB_PRM_TOGGLE                  (FCR_CTRLB_PRM_TOGGLE_Val << FCR_CTRLB_PRM_Pos)      /* (FCR_CTRLB) Toggle the Flash Power Mode Position */
#define FCR_CTRLB_CHEINV_Pos                  _UINT32_(7)                                          /* (FCR_CTRLB) Cache InvalidateCache invalidation takes 1 clock cycle, but may be delayed by an active read. Position */
#define FCR_CTRLB_CHEINV_Msk                  (_UINT32_(0x1) << FCR_CTRLB_CHEINV_Pos)              /* (FCR_CTRLB) Cache InvalidateCache invalidation takes 1 clock cycle, but may be delayed by an active read. Mask */
#define FCR_CTRLB_CHEINV(value)               (FCR_CTRLB_CHEINV_Msk & (_UINT32_(value) << FCR_CTRLB_CHEINV_Pos)) /* Assignment of value for CHEINV in the FCR_CTRLB register */
#define   FCR_CTRLB_CHEINV_NONE_Val           _UINT32_(0x0)                                        /* (FCR_CTRLB) No Action  */
#define   FCR_CTRLB_CHEINV_INV_Val            _UINT32_(0x1)                                        /* (FCR_CTRLB) Invalidate Cache  */
#define FCR_CTRLB_CHEINV_NONE                 (FCR_CTRLB_CHEINV_NONE_Val << FCR_CTRLB_CHEINV_Pos)  /* (FCR_CTRLB) No Action Position */
#define FCR_CTRLB_CHEINV_INV                  (FCR_CTRLB_CHEINV_INV_Val << FCR_CTRLB_CHEINV_Pos)   /* (FCR_CTRLB) Invalidate Cache Position */
#define FCR_CTRLB_SLP_Pos                     _UINT32_(8)                                          /* (FCR_CTRLB) NVM Power Reduction Mode selection during System Standby Sleep Position */
#define FCR_CTRLB_SLP_Msk                     (_UINT32_(0x3) << FCR_CTRLB_SLP_Pos)                 /* (FCR_CTRLB) NVM Power Reduction Mode selection during System Standby Sleep Mask */
#define FCR_CTRLB_SLP(value)                  (FCR_CTRLB_SLP_Msk & (_UINT32_(value) << FCR_CTRLB_SLP_Pos)) /* Assignment of value for SLP in the FCR_CTRLB register */
#define   FCR_CTRLB_SLP_MANUAL_Val            _UINT32_(0x0)                                        /* (FCR_CTRLB) Maintain state of STATUS.PRM on entry to Standby  */
#define   FCR_CTRLB_SLP_RSVD01_Val            _UINT32_(0x1)                                        /* (FCR_CTRLB) RSVD  */
#define   FCR_CTRLB_SLP_AUTOFAST_Val          _UINT32_(0x2)                                        /* (FCR_CTRLB) Enter Flash Hibernate on entry to Standby w/ wakeup to Auto Standby  */
#define   FCR_CTRLB_SLP_AUTOSLOW_Val          _UINT32_(0x3)                                        /* (FCR_CTRLB) Enter Flash Hibernate on entry to Standby w/ wakeup on first access  */
#define FCR_CTRLB_SLP_MANUAL                  (FCR_CTRLB_SLP_MANUAL_Val << FCR_CTRLB_SLP_Pos)      /* (FCR_CTRLB) Maintain state of STATUS.PRM on entry to Standby Position */
#define FCR_CTRLB_SLP_RSVD01                  (FCR_CTRLB_SLP_RSVD01_Val << FCR_CTRLB_SLP_Pos)      /* (FCR_CTRLB) RSVD Position */
#define FCR_CTRLB_SLP_AUTOFAST                (FCR_CTRLB_SLP_AUTOFAST_Val << FCR_CTRLB_SLP_Pos)    /* (FCR_CTRLB) Enter Flash Hibernate on entry to Standby w/ wakeup to Auto Standby Position */
#define FCR_CTRLB_SLP_AUTOSLOW                (FCR_CTRLB_SLP_AUTOSLOW_Val << FCR_CTRLB_SLP_Pos)    /* (FCR_CTRLB) Enter Flash Hibernate on entry to Standby w/ wakeup on first access Position */
#define FCR_CTRLB_CHEDIS_Pos                  _UINT32_(16)                                         /* (FCR_CTRLB) Cache Disable Position */
#define FCR_CTRLB_CHEDIS_Msk                  (_UINT32_(0x1) << FCR_CTRLB_CHEDIS_Pos)              /* (FCR_CTRLB) Cache Disable Mask */
#define FCR_CTRLB_CHEDIS(value)               (FCR_CTRLB_CHEDIS_Msk & (_UINT32_(value) << FCR_CTRLB_CHEDIS_Pos)) /* Assignment of value for CHEDIS in the FCR_CTRLB register */
#define   FCR_CTRLB_CHEDIS_ENABLE_Val         _UINT32_(0x0)                                        /* (FCR_CTRLB) Cache Enabled; Accesses to flash use AUTOWS/FSW selection.  */
#define   FCR_CTRLB_CHEDIS_DISABLE_Val        _UINT32_(0x1)                                        /* (FCR_CTRLB) Cache Disabled; Interface uses RDBUFWS selection.  */
#define FCR_CTRLB_CHEDIS_ENABLE               (FCR_CTRLB_CHEDIS_ENABLE_Val << FCR_CTRLB_CHEDIS_Pos) /* (FCR_CTRLB) Cache Enabled; Accesses to flash use AUTOWS/FSW selection. Position */
#define FCR_CTRLB_CHEDIS_DISABLE              (FCR_CTRLB_CHEDIS_DISABLE_Val << FCR_CTRLB_CHEDIS_Pos) /* (FCR_CTRLB) Cache Disabled; Interface uses RDBUFWS selection. Position */
#define FCR_CTRLB_PREFDIS_Pos                 _UINT32_(17)                                         /* (FCR_CTRLB) Prefetch Disable Position */
#define FCR_CTRLB_PREFDIS_Msk                 (_UINT32_(0x1) << FCR_CTRLB_PREFDIS_Pos)             /* (FCR_CTRLB) Prefetch Disable Mask */
#define FCR_CTRLB_PREFDIS(value)              (FCR_CTRLB_PREFDIS_Msk & (_UINT32_(value) << FCR_CTRLB_PREFDIS_Pos)) /* Assignment of value for PREFDIS in the FCR_CTRLB register */
#define   FCR_CTRLB_PREFDIS_ENABLE_Val        _UINT32_(0x0)                                        /* (FCR_CTRLB) Predictive Prefetch Enabled  */
#define   FCR_CTRLB_PREFDIS_DISABLE_Val       _UINT32_(0x1)                                        /* (FCR_CTRLB) Predictive Prefetch Disabled  */
#define FCR_CTRLB_PREFDIS_ENABLE              (FCR_CTRLB_PREFDIS_ENABLE_Val << FCR_CTRLB_PREFDIS_Pos) /* (FCR_CTRLB) Predictive Prefetch Enabled Position */
#define FCR_CTRLB_PREFDIS_DISABLE             (FCR_CTRLB_PREFDIS_DISABLE_Val << FCR_CTRLB_PREFDIS_Pos) /* (FCR_CTRLB) Predictive Prefetch Disabled Position */
#define FCR_CTRLB_Msk                         _UINT32_(0x00030381)                                 /* (FCR_CTRLB) Register Mask  */


/* -------- FCR_INTENCLR : (FCR Offset: 0x08) (R/W 32) Interrupt Enable Clear REGISTER -------- */
#define FCR_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_INTENCLR) Interrupt Enable Clear REGISTER  Reset Value */

