Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcr.h
/* -------- FCR_STATUS : (FCR Offset: 0x18) ( R/ 32) Status REGISTER -------- */
#define FCR_STATUS_RESETVALUE                 _UINT32_(0xE0000000)                                 /*  (FCR_STATUS) Status REGISTER  Reset Value */

#define FCR_STATUS_PRM_Pos                    _UINT32_(0)                                          /* (FCR_STATUS) NVM Power Reduction Mode Status Position */
#define FCR_STATUS_PRM_Msk                    (_UINT32_(0x1) << FCR_STATUS_PRM_Pos)                /* (FCR_STATUS) NVM Power Reduction Mode Status Mask */
#define FCR_STATUS_PRM(value)                 (FCR_STATUS_PRM_Msk & (_UINT32_(value) << FCR_STATUS_PRM_Pos)) /* Assignment of value for PRM in the FCR_STATUS register */
#define   FCR_STATUS_PRM_0_Val                _UINT32_(0x0)                                        /* (FCR_STATUS) Flash is Ready (for read or NVMOP)  */
#define   FCR_STATUS_PRM_1_Val                _UINT32_(0x1)                                        /* (FCR_STATUS) Flash is Powered Down and wakes on first access (read or NVMOP)  */
#define FCR_STATUS_PRM_0                      (FCR_STATUS_PRM_0_Val << FCR_STATUS_PRM_Pos)         /* (FCR_STATUS) Flash is Ready (for read or NVMOP) Position */
#define FCR_STATUS_PRM_1                      (FCR_STATUS_PRM_1_Val << FCR_STATUS_PRM_Pos)         /* (FCR_STATUS) Flash is Powered Down and wakes on first access (read or NVMOP) Position */
#define FCR_STATUS_Msk                        _UINT32_(0x00000001)                                 /* (FCR_STATUS) Register Mask  */


/* -------- FCR_DBGCTRL : (FCR Offset: 0x1C) (R/W 32) Debug Control CTRL REGISTER -------- */
#define FCR_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_DBGCTRL) Debug Control CTRL REGISTER  Reset Value */

#define FCR_DBGCTRL_CRCRUN_Pos                _UINT32_(0)                                          /* (FCR_DBGCTRL) CRC Debug Run Enable Position */
#define FCR_DBGCTRL_CRCRUN_Msk                (_UINT32_(0x1) << FCR_DBGCTRL_CRCRUN_Pos)            /* (FCR_DBGCTRL) CRC Debug Run Enable Mask */
#define FCR_DBGCTRL_CRCRUN(value)             (FCR_DBGCTRL_CRCRUN_Msk & (_UINT32_(value) << FCR_DBGCTRL_CRCRUN_Pos)) /* Assignment of value for CRCRUN in the FCR_DBGCTRL register */
#define   FCR_DBGCTRL_CRCRUN_HALT_Val         _UINT32_(0x0)                                        /* (FCR_DBGCTRL) CRC Logic Halts in Debug Mode  */
#define   FCR_DBGCTRL_CRCRUN_RUN_Val          _UINT32_(0x1)                                        /* (FCR_DBGCTRL) CRC Logic Runs in Debug Mode.  */
#define FCR_DBGCTRL_CRCRUN_HALT               (FCR_DBGCTRL_CRCRUN_HALT_Val << FCR_DBGCTRL_CRCRUN_Pos) /* (FCR_DBGCTRL) CRC Logic Halts in Debug Mode Position */
#define FCR_DBGCTRL_CRCRUN_RUN                (FCR_DBGCTRL_CRCRUN_RUN_Val << FCR_DBGCTRL_CRCRUN_Pos) /* (FCR_DBGCTRL) CRC Logic Runs in Debug Mode. Position */
#define FCR_DBGCTRL_DBGECC_Pos                _UINT32_(1)                                          /* (FCR_DBGCTRL) Debug ECC ModeECC errors from debugger reads are: Position */
#define FCR_DBGCTRL_DBGECC_Msk                (_UINT32_(0x3) << FCR_DBGCTRL_DBGECC_Pos)            /* (FCR_DBGCTRL) Debug ECC ModeECC errors from debugger reads are: Mask */
#define FCR_DBGCTRL_DBGECC(value)             (FCR_DBGCTRL_DBGECC_Msk & (_UINT32_(value) << FCR_DBGCTRL_DBGECC_Pos)) /* Assignment of value for DBGECC in the FCR_DBGCTRL register */
#define   FCR_DBGCTRL_DBGECC_NOERR_Val        _UINT32_(0x0)                                        /* (FCR_DBGCTRL) Corrected per ECCCTRL; No Bus ERR; INTFLAG, SEC counter, and FLT logic are not updated.  */
#define   FCR_DBGCTRL_DBGECC_DISABLE_Val      _UINT32_(0x1)                                        /* (FCR_DBGCTRL) Not corrected; No Bus Error; INTFLAG, SEC counter, and FLT logic are not updated.  */
#define   FCR_DBGCTRL_DBGECC_ENABLE_Val       _UINT32_(0x2)                                        /* (FCR_DBGCTRL) Corrected per ECCCTRL; Bus Error, INTFLAG, SEC counter, and FLT logic operates as setup.  */
#define   FCR_DBGCTRL_DBGECC_RSVD11_Val       _UINT32_(0x3)                                        /* (FCR_DBGCTRL) Don't use but same as 01 (DISABLE)  */
#define FCR_DBGCTRL_DBGECC_NOERR              (FCR_DBGCTRL_DBGECC_NOERR_Val << FCR_DBGCTRL_DBGECC_Pos) /* (FCR_DBGCTRL) Corrected per ECCCTRL; No Bus ERR; INTFLAG, SEC counter, and FLT logic are not updated. Position */
#define FCR_DBGCTRL_DBGECC_DISABLE            (FCR_DBGCTRL_DBGECC_DISABLE_Val << FCR_DBGCTRL_DBGECC_Pos) /* (FCR_DBGCTRL) Not corrected; No Bus Error; INTFLAG, SEC counter, and FLT logic are not updated. Position */
#define FCR_DBGCTRL_DBGECC_ENABLE             (FCR_DBGCTRL_DBGECC_ENABLE_Val << FCR_DBGCTRL_DBGECC_Pos) /* (FCR_DBGCTRL) Corrected per ECCCTRL; Bus Error, INTFLAG, SEC counter, and FLT logic operates as setup. Position */
#define FCR_DBGCTRL_DBGECC_RSVD11             (FCR_DBGCTRL_DBGECC_RSVD11_Val << FCR_DBGCTRL_DBGECC_Pos) /* (FCR_DBGCTRL) Don't use but same as 01 (DISABLE) Position */
#define FCR_DBGCTRL_Msk                       _UINT32_(0x00000007)                                 /* (FCR_DBGCTRL) Register Mask  */


/* -------- FCR_ECCCTRL : (FCR Offset: 0x20) (R/W 32) ECC Control REGISTER -------- */
#define FCR_ECCCTRL_RESETVALUE                _UINT32_(0x40)                                       /*  (FCR_ECCCTRL) ECC Control REGISTER  Reset Value */

#define FCR_ECCCTRL_ECCCTL_Pos                _UINT32_(4)                                          /* (FCR_ECCCTRL) NVM ECC Mode Control - restricts one or more NVMOPs Position */
#define FCR_ECCCTRL_ECCCTL_Msk                (_UINT32_(0x3) << FCR_ECCCTRL_ECCCTL_Pos)            /* (FCR_ECCCTRL) NVM ECC Mode Control - restricts one or more NVMOPs Mask */
#define FCR_ECCCTRL_ECCCTL(value)             (FCR_ECCCTRL_ECCCTL_Msk & (_UINT32_(value) << FCR_ECCCTRL_ECCCTL_Pos)) /* Assignment of value for ECCCTL in the FCR_ECCCTRL register */
#define   FCR_ECCCTRL_ECCCTL_STRICT_Val       _UINT32_(0x0)                                        /* (FCR_ECCCTRL) ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)  */
#define   FCR_ECCCTRL_ECCCTL_DYNAMIC_Val      _UINT32_(0x1)                                        /* (FCR_ECCCTRL) Dynamic Writes with Dynamic Reads  */
#define   FCR_ECCCTRL_ECCCTL_ECC_Val          _UINT32_(0x2)                                        /* (FCR_ECCCTRL) ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)  */
#define   FCR_ECCCTRL_ECCCTL_DISABLE_Val      _UINT32_(0x3)                                        /* (FCR_ECCCTRL) Dynamic Writes with No Error Check Reads  */
#define FCR_ECCCTRL_ECCCTL_STRICT             (FCR_ECCCTRL_ECCCTL_STRICT_Val << FCR_ECCCTRL_ECCCTL_Pos) /* (FCR_ECCCTRL) ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled) Position */
#define FCR_ECCCTRL_ECCCTL_DYNAMIC            (FCR_ECCCTRL_ECCCTL_DYNAMIC_Val << FCR_ECCCTRL_ECCCTL_Pos) /* (FCR_ECCCTRL) Dynamic Writes with Dynamic Reads Position */
#define FCR_ECCCTRL_ECCCTL_ECC                (FCR_ECCCTRL_ECCCTL_ECC_Val << FCR_ECCCTRL_ECCCTL_Pos) /* (FCR_ECCCTRL) ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled) Position */
#define FCR_ECCCTRL_ECCCTL_DISABLE            (FCR_ECCCTRL_ECCCTL_DISABLE_Val << FCR_ECCCTRL_ECCCTL_Pos) /* (FCR_ECCCTRL) Dynamic Writes with No Error Check Reads Position */
#define FCR_ECCCTRL_ECCUNLCK_Pos              _UINT32_(6)                                          /* (FCR_ECCCTRL) NVM ECC Mode Control Unlock Position */
#define FCR_ECCCTRL_ECCUNLCK_Msk              (_UINT32_(0x1) << FCR_ECCCTRL_ECCUNLCK_Pos)          /* (FCR_ECCCTRL) NVM ECC Mode Control Unlock Mask */
#define FCR_ECCCTRL_ECCUNLCK(value)           (FCR_ECCCTRL_ECCUNLCK_Msk & (_UINT32_(value) << FCR_ECCCTRL_ECCUNLCK_Pos)) /* Assignment of value for ECCUNLCK in the FCR_ECCCTRL register */
#define   FCR_ECCCTRL_ECCUNLCK_LOCKED_Val     _UINT32_(0x0)                                        /* (FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] cannot be written  */
#define   FCR_ECCCTRL_ECCUNLCK_UNLOCKED_Val   _UINT32_(0x1)                                        /* (FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] can be written  */
#define FCR_ECCCTRL_ECCUNLCK_LOCKED           (FCR_ECCCTRL_ECCUNLCK_LOCKED_Val << FCR_ECCCTRL_ECCUNLCK_Pos) /* (FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] cannot be written Position */
#define FCR_ECCCTRL_ECCUNLCK_UNLOCKED         (FCR_ECCCTRL_ECCUNLCK_UNLOCKED_Val << FCR_ECCCTRL_ECCUNLCK_Pos) /* (FCR_ECCCTRL) ECCUNLCK and ECCCTL[1:0] can be written Position */
#define FCR_ECCCTRL_SECCNT_Pos                _UINT32_(8)                                          /* (FCR_ECCCTRL) Flash SEC Count Position */
#define FCR_ECCCTRL_SECCNT_Msk                (_UINT32_(0xFF) << FCR_ECCCTRL_SECCNT_Pos)           /* (FCR_ECCCTRL) Flash SEC Count Mask */
#define FCR_ECCCTRL_SECCNT(value)             (FCR_ECCCTRL_SECCNT_Msk & (_UINT32_(value) << FCR_ECCCTRL_SECCNT_Pos)) /* Assignment of value for SECCNT in the FCR_ECCCTRL register */
#define FCR_ECCCTRL_Msk                       _UINT32_(0x0000FF70)                                 /* (FCR_ECCCTRL) Register Mask  */


/* -------- FCR_CRCCTRL : (FCR Offset: 0x24) (R/W 32) CRC Control REGISTER -------- */
#define FCR_CRCCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCCTRL) CRC Control REGISTER  Reset Value */

#define FCR_CRCCTRL_CRCRST_Pos                _UINT32_(0)                                          /* (FCR_CRCCTRL) CRC Reset Position */
#define FCR_CRCCTRL_CRCRST_Msk                (_UINT32_(0x1) << FCR_CRCCTRL_CRCRST_Pos)            /* (FCR_CRCCTRL) CRC Reset Mask */
#define FCR_CRCCTRL_CRCRST(value)             (FCR_CRCCTRL_CRCRST_Msk & (_UINT32_(value) << FCR_CRCCTRL_CRCRST_Pos)) /* Assignment of value for CRCRST in the FCR_CRCCTRL register */
#define   FCR_CRCCTRL_CRCRST_NONE_Val         _UINT32_(0x0)                                        /* (FCR_CRCCTRL) No Action  */
#define   FCR_CRCCTRL_CRCRST_RESET_Val        _UINT32_(0x1)                                        /* (FCR_CRCCTRL) Resets all CRC SFR bits.  */
#define FCR_CRCCTRL_CRCRST_NONE               (FCR_CRCCTRL_CRCRST_NONE_Val << FCR_CRCCTRL_CRCRST_Pos) /* (FCR_CRCCTRL) No Action Position */
#define FCR_CRCCTRL_CRCRST_RESET              (FCR_CRCCTRL_CRCRST_RESET_Val << FCR_CRCCTRL_CRCRST_Pos) /* (FCR_CRCCTRL) Resets all CRC SFR bits. Position */
#define FCR_CRCCTRL_CRCEN_Pos                 _UINT32_(1)                                          /* (FCR_CRCCTRL) Start CRC Calculation Position */
#define FCR_CRCCTRL_CRCEN_Msk                 (_UINT32_(0x1) << FCR_CRCCTRL_CRCEN_Pos)             /* (FCR_CRCCTRL) Start CRC Calculation Mask */
#define FCR_CRCCTRL_CRCEN(value)              (FCR_CRCCTRL_CRCEN_Msk & (_UINT32_(value) << FCR_CRCCTRL_CRCEN_Pos)) /* Assignment of value for CRCEN in the FCR_CRCCTRL register */
#define   FCR_CRCCTRL_CRCEN_DISABLE_Val       _UINT32_(0x0)                                        /* (FCR_CRCCTRL) Stops CRC calculation.  */
#define   FCR_CRCCTRL_CRCEN_ENABLE_Val        _UINT32_(0x1)                                        /* (FCR_CRCCTRL) CRC Calculation Enabled (w/ start on write to 1).  */
#define FCR_CRCCTRL_CRCEN_DISABLE             (FCR_CRCCTRL_CRCEN_DISABLE_Val << FCR_CRCCTRL_CRCEN_Pos) /* (FCR_CRCCTRL) Stops CRC calculation. Position */
#define FCR_CRCCTRL_CRCEN_ENABLE              (FCR_CRCCTRL_CRCEN_ENABLE_Val << FCR_CRCCTRL_CRCEN_Pos) /* (FCR_CRCCTRL) CRC Calculation Enabled (w/ start on write to 1). Position */
#define FCR_CRCCTRL_RUNSTDBY_Pos              _UINT32_(5)                                          /* (FCR_CRCCTRL) CRC Run in Standby Position */
#define FCR_CRCCTRL_RUNSTDBY_Msk              (_UINT32_(0x1) << FCR_CRCCTRL_RUNSTDBY_Pos)          /* (FCR_CRCCTRL) CRC Run in Standby Mask */
#define FCR_CRCCTRL_RUNSTDBY(value)           (FCR_CRCCTRL_RUNSTDBY_Msk & (_UINT32_(value) << FCR_CRCCTRL_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the FCR_CRCCTRL register */
#define   FCR_CRCCTRL_RUNSTDBY_HALT_Val       _UINT32_(0x0)                                        /* (FCR_CRCCTRL) CRC Halts in Standby  */
#define   FCR_CRCCTRL_RUNSTDBY_RUN_Val        _UINT32_(0x1)                                        /* (FCR_CRCCTRL) CRC Runs in Standby but only if STATUS.PRM=0 (i.e. Flash is in Auto Standby)  */
#define FCR_CRCCTRL_RUNSTDBY_HALT             (FCR_CRCCTRL_RUNSTDBY_HALT_Val << FCR_CRCCTRL_RUNSTDBY_Pos) /* (FCR_CRCCTRL) CRC Halts in Standby Position */
#define FCR_CRCCTRL_RUNSTDBY_RUN              (FCR_CRCCTRL_RUNSTDBY_RUN_Val << FCR_CRCCTRL_RUNSTDBY_Pos) /* (FCR_CRCCTRL) CRC Runs in Standby but only if STATUS.PRM=0 (i.e. Flash is in Auto Standby) Position */
#define FCR_CRCCTRL_Msk                       _UINT32_(0x00000023)                                 /* (FCR_CRCCTRL) Register Mask  */


/* -------- FCR_CRCMODE : (FCR Offset: 0x28) (R/W 32) CRC MODE REGISTER -------- */
#define FCR_CRCMODE_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCMODE) CRC MODE REGISTER  Reset Value */

#define FCR_CRCMODE_PLEN32_Pos                _UINT32_(12)                                         /* (FCR_CRCMODE) Polynomial Length Select Position */
#define FCR_CRCMODE_PLEN32_Msk                (_UINT32_(0x1) << FCR_CRCMODE_PLEN32_Pos)            /* (FCR_CRCMODE) Polynomial Length Select Mask */
#define FCR_CRCMODE_PLEN32(value)             (FCR_CRCMODE_PLEN32_Msk & (_UINT32_(value) << FCR_CRCMODE_PLEN32_Pos)) /* Assignment of value for PLEN32 in the FCR_CRCMODE register */
#define   FCR_CRCMODE_PLEN32_SIXTEEN_Val      _UINT32_(0x0)                                        /* (FCR_CRCMODE) Polynomial is 16-bits  */
#define   FCR_CRCMODE_PLEN32_THIRTYTWO_Val    _UINT32_(0x1)                                        /* (FCR_CRCMODE) Polynomial is 32-bits  */
#define FCR_CRCMODE_PLEN32_SIXTEEN            (FCR_CRCMODE_PLEN32_SIXTEEN_Val << FCR_CRCMODE_PLEN32_Pos) /* (FCR_CRCMODE) Polynomial is 16-bits Position */
#define FCR_CRCMODE_PLEN32_THIRTYTWO          (FCR_CRCMODE_PLEN32_THIRTYTWO_Val << FCR_CRCMODE_PLEN32_Pos) /* (FCR_CRCMODE) Polynomial is 32-bits Position */
#define FCR_CRCMODE_AUTOR_Pos                 _UINT32_(13)                                         /* (FCR_CRCMODE) CRC Auto Repeat Position */
#define FCR_CRCMODE_AUTOR_Msk                 (_UINT32_(0x1) << FCR_CRCMODE_AUTOR_Pos)             /* (FCR_CRCMODE) CRC Auto Repeat Mask */
#define FCR_CRCMODE_AUTOR(value)              (FCR_CRCMODE_AUTOR_Msk & (_UINT32_(value) << FCR_CRCMODE_AUTOR_Pos)) /* Assignment of value for AUTOR in the FCR_CRCMODE register */
#define   FCR_CRCMODE_AUTOR_DISABLE_Val       _UINT32_(0x0)                                        /* (FCR_CRCMODE) Perform CRC calculation once then set DONE and if needed, CRCERR.  */
#define   FCR_CRCMODE_AUTOR_ENABLE_Val        _UINT32_(0x1)                                        /* (FCR_CRCMODE) Continually Repeat CRC calculation; stop on error, set CRCDONE and CRCERR  */
#define FCR_CRCMODE_AUTOR_DISABLE             (FCR_CRCMODE_AUTOR_DISABLE_Val << FCR_CRCMODE_AUTOR_Pos) /* (FCR_CRCMODE) Perform CRC calculation once then set DONE and if needed, CRCERR. Position */
#define FCR_CRCMODE_AUTOR_ENABLE              (FCR_CRCMODE_AUTOR_ENABLE_Val << FCR_CRCMODE_AUTOR_Pos) /* (FCR_CRCMODE) Continually Repeat CRC calculation; stop on error, set CRCDONE and CRCERR Position */
#define FCR_CRCMODE_ROUT_Pos                  _UINT32_(14)                                         /* (FCR_CRCMODE) CRC Reflected Output Position */
#define FCR_CRCMODE_ROUT_Msk                  (_UINT32_(0x1) << FCR_CRCMODE_ROUT_Pos)              /* (FCR_CRCMODE) CRC Reflected Output Mask */
#define FCR_CRCMODE_ROUT(value)               (FCR_CRCMODE_ROUT_Msk & (_UINT32_(value) << FCR_CRCMODE_ROUT_Pos)) /* Assignment of value for ROUT in the FCR_CRCMODE register */
#define   FCR_CRCMODE_ROUT_DISABLE_Val        _UINT32_(0x0)                                        /* (FCR_CRCMODE) The CRCACC is Not Reflected  */
#define   FCR_CRCMODE_ROUT_ENABLE_Val         _UINT32_(0x1)                                        /* (FCR_CRCMODE) The CRCACC is Reflected (before the Final XOR)  */
#define FCR_CRCMODE_ROUT_DISABLE              (FCR_CRCMODE_ROUT_DISABLE_Val << FCR_CRCMODE_ROUT_Pos) /* (FCR_CRCMODE) The CRCACC is Not Reflected Position */
#define FCR_CRCMODE_ROUT_ENABLE               (FCR_CRCMODE_ROUT_ENABLE_Val << FCR_CRCMODE_ROUT_Pos) /* (FCR_CRCMODE) The CRCACC is Reflected (before the Final XOR) Position */
#define FCR_CRCMODE_RIN_Pos                   _UINT32_(15)                                         /* (FCR_CRCMODE) CRC Reflected Input Position */
#define FCR_CRCMODE_RIN_Msk                   (_UINT32_(0x1) << FCR_CRCMODE_RIN_Pos)               /* (FCR_CRCMODE) CRC Reflected Input Mask */
#define FCR_CRCMODE_RIN(value)                (FCR_CRCMODE_RIN_Msk & (_UINT32_(value) << FCR_CRCMODE_RIN_Pos)) /* Assignment of value for RIN in the FCR_CRCMODE register */
#define   FCR_CRCMODE_RIN_DISABLE_Val         _UINT32_(0x0)                                        /* (FCR_CRCMODE) The LFSR CRC is calculated Most Significant Bit first (Not Reflected)  */
#define   FCR_CRCMODE_RIN_ENABLE_Val          _UINT32_(0x1)                                        /* (FCR_CRCMODE) The LFSR CRC is calculated Least Significant Bit first (Reflected)  */
#define FCR_CRCMODE_RIN_DISABLE               (FCR_CRCMODE_RIN_DISABLE_Val << FCR_CRCMODE_RIN_Pos) /* (FCR_CRCMODE) The LFSR CRC is calculated Most Significant Bit first (Not Reflected) Position */
#define FCR_CRCMODE_RIN_ENABLE                (FCR_CRCMODE_RIN_ENABLE_Val << FCR_CRCMODE_RIN_Pos)  /* (FCR_CRCMODE) The LFSR CRC is calculated Least Significant Bit first (Reflected) Position */
#define FCR_CRCMODE_PERIOD_Pos                _UINT32_(16)                                         /* (FCR_CRCMODE) Read Period in PerCLK counts Position */
#define FCR_CRCMODE_PERIOD_Msk                (_UINT32_(0xFFF) << FCR_CRCMODE_PERIOD_Pos)          /* (FCR_CRCMODE) Read Period in PerCLK counts Mask */
#define FCR_CRCMODE_PERIOD(value)             (FCR_CRCMODE_PERIOD_Msk & (_UINT32_(value) << FCR_CRCMODE_PERIOD_Pos)) /* Assignment of value for PERIOD in the FCR_CRCMODE register */
#define FCR_CRCMODE_Msk                       _UINT32_(0x0FFFF000)                                 /* (FCR_CRCMODE) Register Mask  */

#define FCR_CRCMODE_PLEN_Pos                  _UINT32_(12)                                         /* (FCR_CRCMODE Position) Polynomial Length Select */
#define FCR_CRCMODE_PLEN_Msk                  (_UINT32_(0x1) << FCR_CRCMODE_PLEN_Pos)              /* (FCR_CRCMODE Mask) PLEN */
#define FCR_CRCMODE_PLEN(value)               (FCR_CRCMODE_PLEN_Msk & (_UINT32_(value) << FCR_CRCMODE_PLEN_Pos)) 

/* -------- FCR_CRCPAUSE : (FCR Offset: 0x2C) (R/W 32) CRC Pause REGISTER -------- */
#define FCR_CRCPAUSE_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_CRCPAUSE) CRC Pause REGISTER  Reset Value */

