Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcr.h
/* -------- FCR_CRCFXOR : (FCR Offset: 0x44) (R/W 32) CRC Final XOR REGISTER -------- */
#define FCR_CRCFXOR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCFXOR) CRC Final XOR REGISTER  Reset Value */

#define FCR_CRCFXOR_CRCFXOR_Pos               _UINT32_(0)                                          /* (FCR_CRCFXOR) CRC Final XOR Position */
#define FCR_CRCFXOR_CRCFXOR_Msk               (_UINT32_(0xFFFFFFFF) << FCR_CRCFXOR_CRCFXOR_Pos)    /* (FCR_CRCFXOR) CRC Final XOR Mask */
#define FCR_CRCFXOR_CRCFXOR(value)            (FCR_CRCFXOR_CRCFXOR_Msk & (_UINT32_(value) << FCR_CRCFXOR_CRCFXOR_Pos)) /* Assignment of value for CRCFXOR in the FCR_CRCFXOR register */
#define   FCR_CRCFXOR_CRCFXOR_0_Val           _UINT32_(0x0)                                        /* (FCR_CRCFXOR) Disable the Final XOR at the associated bit position  */
#define   FCR_CRCFXOR_CRCFXOR_1_Val           _UINT32_(0x1)                                        /* (FCR_CRCFXOR) Enable the Final XOR at the associated bit position  */
#define FCR_CRCFXOR_CRCFXOR_0                 (FCR_CRCFXOR_CRCFXOR_0_Val << FCR_CRCFXOR_CRCFXOR_Pos) /* (FCR_CRCFXOR) Disable the Final XOR at the associated bit position Position */
#define FCR_CRCFXOR_CRCFXOR_1                 (FCR_CRCFXOR_CRCFXOR_1_Val << FCR_CRCFXOR_CRCFXOR_Pos) /* (FCR_CRCFXOR) Enable the Final XOR at the associated bit position Position */
#define FCR_CRCFXOR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCFXOR) Register Mask  */


/* -------- FCR_CRCSUM : (FCR Offset: 0x48) (R/W 32) CRC CheckSUM REGISTER -------- */
#define FCR_CRCSUM_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCR_CRCSUM) CRC CheckSUM REGISTER  Reset Value */

#define FCR_CRCSUM_CRCSUM_Pos                 _UINT32_(0)                                          /* (FCR_CRCSUM) CRC Checksum Position */
#define FCR_CRCSUM_CRCSUM_Msk                 (_UINT32_(0xFFFFFFFF) << FCR_CRCSUM_CRCSUM_Pos)      /* (FCR_CRCSUM) CRC Checksum Mask */
#define FCR_CRCSUM_CRCSUM(value)              (FCR_CRCSUM_CRCSUM_Msk & (_UINT32_(value) << FCR_CRCSUM_CRCSUM_Pos)) /* Assignment of value for CRCSUM in the FCR_CRCSUM register */
#define FCR_CRCSUM_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCSUM) Register Mask  */


/* -------- FCR_FFLTCTRL : (FCR Offset: 0x4C) (R/W 32) Flash ECC Fault Control REGISTER -------- */
#define FCR_FFLTCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_FFLTCTRL) Flash ECC Fault Control REGISTER  Reset Value */

#define FCR_FFLTCTRL_FLTRST_Pos               _UINT32_(0)                                          /* (FCR_FFLTCTRL) Fault Reset Position */
#define FCR_FFLTCTRL_FLTRST_Msk               (_UINT32_(0x1) << FCR_FFLTCTRL_FLTRST_Pos)           /* (FCR_FFLTCTRL) Fault Reset Mask */
#define FCR_FFLTCTRL_FLTRST(value)            (FCR_FFLTCTRL_FLTRST_Msk & (_UINT32_(value) << FCR_FFLTCTRL_FLTRST_Pos)) /* Assignment of value for FLTRST in the FCR_FFLTCTRL register */
#define   FCR_FFLTCTRL_FLTRST_NONE_Val        _UINT32_(0x0)                                        /* (FCR_FFLTCTRL) No Action  */
#define   FCR_FFLTCTRL_FLTRST_RESET_Val       _UINT32_(0x1)                                        /* (FCR_FFLTCTRL) Resets all FLT SFR bits.  */
#define FCR_FFLTCTRL_FLTRST_NONE              (FCR_FFLTCTRL_FLTRST_NONE_Val << FCR_FFLTCTRL_FLTRST_Pos) /* (FCR_FFLTCTRL) No Action Position */
#define FCR_FFLTCTRL_FLTRST_RESET             (FCR_FFLTCTRL_FLTRST_RESET_Val << FCR_FFLTCTRL_FLTRST_Pos) /* (FCR_FFLTCTRL) Resets all FLT SFR bits. Position */
#define FCR_FFLTCTRL_FLTEN_Pos                _UINT32_(1)                                          /* (FCR_FFLTCTRL) ECC Fault Enable bit Position */
#define FCR_FFLTCTRL_FLTEN_Msk                (_UINT32_(0x1) << FCR_FFLTCTRL_FLTEN_Pos)            /* (FCR_FFLTCTRL) ECC Fault Enable bit Mask */
#define FCR_FFLTCTRL_FLTEN(value)             (FCR_FFLTCTRL_FLTEN_Msk & (_UINT32_(value) << FCR_FFLTCTRL_FLTEN_Pos)) /* Assignment of value for FLTEN in the FCR_FFLTCTRL register */
#define   FCR_FFLTCTRL_FLTEN_DISABLE_Val      _UINT32_(0x0)                                        /* (FCR_FFLTCTRL) ECC Fault Injection Disabled  */
#define   FCR_FFLTCTRL_FLTEN_ENABLE_Val       _UINT32_(0x1)                                        /* (FCR_FFLTCTRL) ECC Fault Injection Enabled (module performs operation selected by FFLTMODE.FLTMD)  */
#define FCR_FFLTCTRL_FLTEN_DISABLE            (FCR_FFLTCTRL_FLTEN_DISABLE_Val << FCR_FFLTCTRL_FLTEN_Pos) /* (FCR_FFLTCTRL) ECC Fault Injection Disabled Position */
#define FCR_FFLTCTRL_FLTEN_ENABLE             (FCR_FFLTCTRL_FLTEN_ENABLE_Val << FCR_FFLTCTRL_FLTEN_Pos) /* (FCR_FFLTCTRL) ECC Fault Injection Enabled (module performs operation selected by FFLTMODE.FLTMD) Position */
#define FCR_FFLTCTRL_Msk                      _UINT32_(0x00000003)                                 /* (FCR_FFLTCTRL) Register Mask  */


/* -------- FCR_FFLTMODE : (FCR Offset: 0x50) (R/W 32) Flash ECC Fault Mode REGISTER -------- */
#define FCR_FFLTMODE_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_FFLTMODE) Flash ECC Fault Mode REGISTER  Reset Value */

#define FCR_FFLTMODE_CTLFLT_Pos               _UINT32_(8)                                          /* (FCR_FFLTMODE) ECC/Parity Control Fault bits Position */
#define FCR_FFLTMODE_CTLFLT_Msk               (_UINT32_(0x7) << FCR_FFLTMODE_CTLFLT_Pos)           /* (FCR_FFLTMODE) ECC/Parity Control Fault bits Mask */
#define FCR_FFLTMODE_CTLFLT(value)            (FCR_FFLTMODE_CTLFLT_Msk & (_UINT32_(value) << FCR_FFLTMODE_CTLFLT_Pos)) /* Assignment of value for CTLFLT in the FCR_FFLTMODE register */
#define   FCR_FFLTMODE_CTLFLT_0_Val           _UINT32_(0x0)                                        /* (FCR_FFLTMODE) No Fault Injected  */
#define   FCR_FFLTMODE_CTLFLT_1_Val           _UINT32_(0x1)                                        /* (FCR_FFLTMODE) Inject a Fault on to the associated ECC/Parity Control bits (CTL[n])  */
#define FCR_FFLTMODE_CTLFLT_0                 (FCR_FFLTMODE_CTLFLT_0_Val << FCR_FFLTMODE_CTLFLT_Pos) /* (FCR_FFLTMODE) No Fault Injected Position */
#define FCR_FFLTMODE_CTLFLT_1                 (FCR_FFLTMODE_CTLFLT_1_Val << FCR_FFLTMODE_CTLFLT_Pos) /* (FCR_FFLTMODE) Inject a Fault on to the associated ECC/Parity Control bits (CTL[n]) Position */
#define FCR_FFLTMODE_FLTMD_Pos                _UINT32_(12)                                         /* (FCR_FFLTMODE) Fault Mode Control Position */
#define FCR_FFLTMODE_FLTMD_Msk                (_UINT32_(0x7) << FCR_FFLTMODE_FLTMD_Pos)            /* (FCR_FFLTMODE) Fault Mode Control Mask */
#define FCR_FFLTMODE_FLTMD(value)             (FCR_FFLTMODE_FLTMD_Msk & (_UINT32_(value) << FCR_FFLTMODE_FLTMD_Pos)) /* Assignment of value for FLTMD in the FCR_FFLTMODE register */
#define   FCR_FFLTMODE_FLTMD_DISABLE_Val      _UINT32_(0x0)                                        /* (FCR_FFLTMODE) Fault Injection Disabled  */
#define   FCR_FFLTMODE_FLTMD_CAPT_Val         _UINT32_(0x2)                                        /* (FCR_FFLTMODE) Fault Capture Mode Enabled - Captures the address (in FLTADR) and Syndrome in (FLTSYN)  */
#define   FCR_FFLTMODE_FLTMD_SINGLEREAD_Val   _UINT32_(0x4)                                        /* (FCR_FFLTMODE) Single Fault Injection (at bit selected by FLT1PTR) for Reads  */
#define   FCR_FFLTMODE_FLTMD_DOUBLEREAD_Val   _UINT32_(0x5)                                        /* (FCR_FFLTMODE) Double Fault Injection for Reads  */
#define   FCR_FFLTMODE_FLTMD_SINGLEWRITE_Val  _UINT32_(0x6)                                        /* (FCR_FFLTMODE) Single Fault Injection (at bit selected by FLT1PTR) for Writes  */
#define   FCR_FFLTMODE_FLTMD_DOUBLEWRITE_Val  _UINT32_(0x7)                                        /* (FCR_FFLTMODE) Double Fault Injection for Writes  */
#define FCR_FFLTMODE_FLTMD_DISABLE            (FCR_FFLTMODE_FLTMD_DISABLE_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Fault Injection Disabled Position */
#define FCR_FFLTMODE_FLTMD_CAPT               (FCR_FFLTMODE_FLTMD_CAPT_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Fault Capture Mode Enabled - Captures the address (in FLTADR) and Syndrome in (FLTSYN) Position */
#define FCR_FFLTMODE_FLTMD_SINGLEREAD         (FCR_FFLTMODE_FLTMD_SINGLEREAD_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Single Fault Injection (at bit selected by FLT1PTR) for Reads Position */
#define FCR_FFLTMODE_FLTMD_DOUBLEREAD         (FCR_FFLTMODE_FLTMD_DOUBLEREAD_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Double Fault Injection for Reads Position */
#define FCR_FFLTMODE_FLTMD_SINGLEWRITE        (FCR_FFLTMODE_FLTMD_SINGLEWRITE_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Single Fault Injection (at bit selected by FLT1PTR) for Writes Position */
#define FCR_FFLTMODE_FLTMD_DOUBLEWRITE        (FCR_FFLTMODE_FLTMD_DOUBLEWRITE_Val << FCR_FFLTMODE_FLTMD_Pos) /* (FCR_FFLTMODE) Double Fault Injection for Writes Position */
#define FCR_FFLTMODE_Msk                      _UINT32_(0x00007700)                                 /* (FCR_FFLTMODE) Register Mask  */


/* -------- FCR_FFLTPTR : (FCR Offset: 0x54) (R/W 32) Flash ECC Fault Pointer REGISTER -------- */
#define FCR_FFLTPTR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTPTR) Flash ECC Fault Pointer REGISTER  Reset Value */

#define FCR_FFLTPTR_FLTPTR1_Pos               _UINT32_(0)                                          /* (FCR_FFLTPTR) Fault 1 Injection Pointer Position */
#define FCR_FFLTPTR_FLTPTR1_Msk               (_UINT32_(0x1FF) << FCR_FFLTPTR_FLTPTR1_Pos)         /* (FCR_FFLTPTR) Fault 1 Injection Pointer Mask */
#define FCR_FFLTPTR_FLTPTR1(value)            (FCR_FFLTPTR_FLTPTR1_Msk & (_UINT32_(value) << FCR_FFLTPTR_FLTPTR1_Pos)) /* Assignment of value for FLTPTR1 in the FCR_FFLTPTR register */
#define FCR_FFLTPTR_FLTPTR2_Pos               _UINT32_(16)                                         /* (FCR_FFLTPTR) Fault 2 Injection Pointer Position */
#define FCR_FFLTPTR_FLTPTR2_Msk               (_UINT32_(0x1FF) << FCR_FFLTPTR_FLTPTR2_Pos)         /* (FCR_FFLTPTR) Fault 2 Injection Pointer Mask */
#define FCR_FFLTPTR_FLTPTR2(value)            (FCR_FFLTPTR_FLTPTR2_Msk & (_UINT32_(value) << FCR_FFLTPTR_FLTPTR2_Pos)) /* Assignment of value for FLTPTR2 in the FCR_FFLTPTR register */
#define FCR_FFLTPTR_Msk                       _UINT32_(0x01FF01FF)                                 /* (FCR_FFLTPTR) Register Mask  */


/* -------- FCR_FFLTADR : (FCR Offset: 0x58) (R/W 32) Flash ECC Fault Address REGISTER -------- */
#define FCR_FFLTADR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTADR) Flash ECC Fault Address REGISTER  Reset Value */

#define FCR_FFLTADR_FLTADR_Pos                _UINT32_(0)                                          /* (FCR_FFLTADR) Fault Injection Address Position */
#define FCR_FFLTADR_FLTADR_Msk                (_UINT32_(0xFFFFFFF) << FCR_FFLTADR_FLTADR_Pos)      /* (FCR_FFLTADR) Fault Injection Address Mask */
#define FCR_FFLTADR_FLTADR(value)             (FCR_FFLTADR_FLTADR_Msk & (_UINT32_(value) << FCR_FFLTADR_FLTADR_Pos)) /* Assignment of value for FLTADR in the FCR_FFLTADR register */
#define FCR_FFLTADR_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_FFLTADR) Register Mask  */


/* -------- FCR_FFLTCAP : (FCR Offset: 0x5C) ( R/ 32) Flash ECC Fault Capture Address REGISTER -------- */
#define FCR_FFLTCAP_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTCAP) Flash ECC Fault Capture Address REGISTER  Reset Value */

#define FCR_FFLTCAP_FLTADR_Pos                _UINT32_(0)                                          /* (FCR_FFLTCAP) Fault Capture Address Position */
#define FCR_FFLTCAP_FLTADR_Msk                (_UINT32_(0xFFFFFFF) << FCR_FFLTCAP_FLTADR_Pos)      /* (FCR_FFLTCAP) Fault Capture Address Mask */
#define FCR_FFLTCAP_FLTADR(value)             (FCR_FFLTCAP_FLTADR_Msk & (_UINT32_(value) << FCR_FFLTCAP_FLTADR_Pos)) /* Assignment of value for FLTADR in the FCR_FFLTCAP register */
#define FCR_FFLTCAP_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_FFLTCAP) Register Mask  */


/* -------- FCR_FFLTPAR : (FCR Offset: 0x60) ( R/ 32) Flash ECC Fault Parity REGISTER -------- */
#define FCR_FFLTPAR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTPAR) Flash ECC Fault Parity REGISTER  Reset Value */

