Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcr.h
#define FCR_CRP_BC1ARP_Pos                    _UINT32_(0)                                          /* (FCR_CRP) Panel 1 Read Protect BootCfg1A Position */
#define FCR_CRP_BC1ARP_Msk                    (_UINT32_(0x1) << FCR_CRP_BC1ARP_Pos)                /* (FCR_CRP) Panel 1 Read Protect BootCfg1A Mask */
#define FCR_CRP_BC1ARP(value)                 (FCR_CRP_BC1ARP_Msk & (_UINT32_(value) << FCR_CRP_BC1ARP_Pos)) /* Assignment of value for BC1ARP in the FCR_CRP register */
#define   FCR_CRP_BC1ARP_DISABLE_Val          _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_BC1ARP_ENABLE_Val           _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_BC1ARP_DISABLE                (FCR_CRP_BC1ARP_DISABLE_Val << FCR_CRP_BC1ARP_Pos)   /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_BC1ARP_ENABLE                 (FCR_CRP_BC1ARP_ENABLE_Val << FCR_CRP_BC1ARP_Pos)    /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_UO1RP_Pos                     _UINT32_(1)                                          /* (FCR_CRP) Panel 1 Read Protect UserOTP1 Position */
#define FCR_CRP_UO1RP_Msk                     (_UINT32_(0x1) << FCR_CRP_UO1RP_Pos)                 /* (FCR_CRP) Panel 1 Read Protect UserOTP1 Mask */
#define FCR_CRP_UO1RP(value)                  (FCR_CRP_UO1RP_Msk & (_UINT32_(value) << FCR_CRP_UO1RP_Pos)) /* Assignment of value for UO1RP in the FCR_CRP register */
#define   FCR_CRP_UO1RP_DISABLE_Val           _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define FCR_CRP_UO1RP_DISABLE                 (FCR_CRP_UO1RP_DISABLE_Val << FCR_CRP_UO1RP_Pos)     /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_BC1RP_Pos                     _UINT32_(2)                                          /* (FCR_CRP) Panel 1 Read Protect BootCfg1 Position */
#define FCR_CRP_BC1RP_Msk                     (_UINT32_(0x1) << FCR_CRP_BC1RP_Pos)                 /* (FCR_CRP) Panel 1 Read Protect BootCfg1 Mask */
#define FCR_CRP_BC1RP(value)                  (FCR_CRP_BC1RP_Msk & (_UINT32_(value) << FCR_CRP_BC1RP_Pos)) /* Assignment of value for BC1RP in the FCR_CRP register */
#define   FCR_CRP_BC1RP_DISABLE_Val           _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_BC1RP_ENABLE_Val            _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_BC1RP_DISABLE                 (FCR_CRP_BC1RP_DISABLE_Val << FCR_CRP_BC1RP_Pos)     /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_BC1RP_ENABLE                  (FCR_CRP_BC1RP_ENABLE_Val << FCR_CRP_BC1RP_Pos)      /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_RCRP_Pos                      _UINT32_(3)                                          /* (FCR_CRP) Panel 1 Read Protect ROMCfg Position */
#define FCR_CRP_RCRP_Msk                      (_UINT32_(0x1) << FCR_CRP_RCRP_Pos)                  /* (FCR_CRP) Panel 1 Read Protect ROMCfg Mask */
#define FCR_CRP_RCRP(value)                   (FCR_CRP_RCRP_Msk & (_UINT32_(value) << FCR_CRP_RCRP_Pos)) /* Assignment of value for RCRP in the FCR_CRP register */
#define   FCR_CRP_RCRP_DISABLE_Val            _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_RCRP_ENABLE_Val             _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_RCRP_DISABLE                  (FCR_CRP_RCRP_DISABLE_Val << FCR_CRP_RCRP_Pos)       /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_RCRP_ENABLE                   (FCR_CRP_RCRP_ENABLE_Val << FCR_CRP_RCRP_Pos)        /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_VSSRP0_Pos                    _UINT32_(4)                                          /* (FCR_CRP) Panel 1 Read Protect VSSn Position */
#define FCR_CRP_VSSRP0_Msk                    (_UINT32_(0x1) << FCR_CRP_VSSRP0_Pos)                /* (FCR_CRP) Panel 1 Read Protect VSSn Mask */
#define FCR_CRP_VSSRP0(value)                 (FCR_CRP_VSSRP0_Msk & (_UINT32_(value) << FCR_CRP_VSSRP0_Pos)) /* Assignment of value for VSSRP0 in the FCR_CRP register */
#define   FCR_CRP_VSSRP0_DISABLE_Val          _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_VSSRP0_ENABLE_Val           _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_VSSRP0_DISABLE                (FCR_CRP_VSSRP0_DISABLE_Val << FCR_CRP_VSSRP0_Pos)   /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_VSSRP0_ENABLE                 (FCR_CRP_VSSRP0_ENABLE_Val << FCR_CRP_VSSRP0_Pos)    /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_VSSRP1_Pos                    _UINT32_(5)                                          /* (FCR_CRP) Panel 1 Read Protect VSSn Position */
#define FCR_CRP_VSSRP1_Msk                    (_UINT32_(0x1) << FCR_CRP_VSSRP1_Pos)                /* (FCR_CRP) Panel 1 Read Protect VSSn Mask */
#define FCR_CRP_VSSRP1(value)                 (FCR_CRP_VSSRP1_Msk & (_UINT32_(value) << FCR_CRP_VSSRP1_Pos)) /* Assignment of value for VSSRP1 in the FCR_CRP register */
#define   FCR_CRP_VSSRP1_DISABLE_Val          _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_VSSRP1_ENABLE_Val           _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_VSSRP1_DISABLE                (FCR_CRP_VSSRP1_DISABLE_Val << FCR_CRP_VSSRP1_Pos)   /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_VSSRP1_ENABLE                 (FCR_CRP_VSSRP1_ENABLE_Val << FCR_CRP_VSSRP1_Pos)    /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_TRP_Pos                       _UINT32_(6)                                          /* (FCR_CRP) Panel 1 Read Protect Test Position */
#define FCR_CRP_TRP_Msk                       (_UINT32_(0x1) << FCR_CRP_TRP_Pos)                   /* (FCR_CRP) Panel 1 Read Protect Test Mask */
#define FCR_CRP_TRP(value)                    (FCR_CRP_TRP_Msk & (_UINT32_(value) << FCR_CRP_TRP_Pos)) /* Assignment of value for TRP in the FCR_CRP register */
#define   FCR_CRP_TRP_DISABLE_Val             _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_TRP_ENABLE_Val              _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_TRP_DISABLE                   (FCR_CRP_TRP_DISABLE_Val << FCR_CRP_TRP_Pos)         /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_TRP_ENABLE                    (FCR_CRP_TRP_ENABLE_Val << FCR_CRP_TRP_Pos)          /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_CORP_Pos                      _UINT32_(7)                                          /* (FCR_CRP) Panel 1 Read Protect CalOTP Position */
#define FCR_CRP_CORP_Msk                      (_UINT32_(0x1) << FCR_CRP_CORP_Pos)                  /* (FCR_CRP) Panel 1 Read Protect CalOTP Mask */
#define FCR_CRP_CORP(value)                   (FCR_CRP_CORP_Msk & (_UINT32_(value) << FCR_CRP_CORP_Pos)) /* Assignment of value for CORP in the FCR_CRP register */
#define   FCR_CRP_CORP_DISABLE_Val            _UINT32_(0x0)                                        /* (FCR_CRP) Read Protection for this Page is Disabled  */
#define   FCR_CRP_CORP_ENABLE_Val             _UINT32_(0x1)                                        /* (FCR_CRP) Read Protection for this Page is Enabled  */
#define FCR_CRP_CORP_DISABLE                  (FCR_CRP_CORP_DISABLE_Val << FCR_CRP_CORP_Pos)       /* (FCR_CRP) Read Protection for this Page is Disabled Position */
#define FCR_CRP_CORP_ENABLE                   (FCR_CRP_CORP_ENABLE_Val << FCR_CRP_CORP_Pos)        /* (FCR_CRP) Read Protection for this Page is Enabled Position */
#define FCR_CRP_BC1ARPLOCK_Pos                _UINT32_(16)                                         /* (FCR_CRP) Panel 1 Lock Read Protection BootCfg1A Position */
#define FCR_CRP_BC1ARPLOCK_Msk                (_UINT32_(0x1) << FCR_CRP_BC1ARPLOCK_Pos)            /* (FCR_CRP) Panel 1 Lock Read Protection BootCfg1A Mask */
#define FCR_CRP_BC1ARPLOCK(value)             (FCR_CRP_BC1ARPLOCK_Msk & (_UINT32_(value) << FCR_CRP_BC1ARPLOCK_Pos)) /* Assignment of value for BC1ARPLOCK in the FCR_CRP register */
#define   FCR_CRP_BC1ARPLOCK_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FCR_CRP_BC1ARPLOCK_LOCKED_Val       _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_BC1ARPLOCK_UNLOCKED           (FCR_CRP_BC1ARPLOCK_UNLOCKED_Val << FCR_CRP_BC1ARPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FCR_CRP_BC1ARPLOCK_LOCKED             (FCR_CRP_BC1ARPLOCK_LOCKED_Val << FCR_CRP_BC1ARPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_UO1RPLOCK_Pos                 _UINT32_(17)                                         /* (FCR_CRP) Panel 1 Lock Read Protection UserOTP1 Position */
#define FCR_CRP_UO1RPLOCK_Msk                 (_UINT32_(0x1) << FCR_CRP_UO1RPLOCK_Pos)             /* (FCR_CRP) Panel 1 Lock Read Protection UserOTP1 Mask */
#define FCR_CRP_UO1RPLOCK(value)              (FCR_CRP_UO1RPLOCK_Msk & (_UINT32_(value) << FCR_CRP_UO1RPLOCK_Pos)) /* Assignment of value for UO1RPLOCK in the FCR_CRP register */
#define   FCR_CRP_UO1RPLOCK_LOCKED_Val        _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_UO1RPLOCK_LOCKED              (FCR_CRP_UO1RPLOCK_LOCKED_Val << FCR_CRP_UO1RPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_BC1RPLOCK_Pos                 _UINT32_(18)                                         /* (FCR_CRP) Panel 1 Lock Read Protection BootCfg1 Position */
#define FCR_CRP_BC1RPLOCK_Msk                 (_UINT32_(0x1) << FCR_CRP_BC1RPLOCK_Pos)             /* (FCR_CRP) Panel 1 Lock Read Protection BootCfg1 Mask */
#define FCR_CRP_BC1RPLOCK(value)              (FCR_CRP_BC1RPLOCK_Msk & (_UINT32_(value) << FCR_CRP_BC1RPLOCK_Pos)) /* Assignment of value for BC1RPLOCK in the FCR_CRP register */
#define   FCR_CRP_BC1RPLOCK_UNLOCKED_Val      _UINT32_(0x0)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FCR_CRP_BC1RPLOCK_LOCKED_Val        _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_BC1RPLOCK_UNLOCKED            (FCR_CRP_BC1RPLOCK_UNLOCKED_Val << FCR_CRP_BC1RPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FCR_CRP_BC1RPLOCK_LOCKED              (FCR_CRP_BC1RPLOCK_LOCKED_Val << FCR_CRP_BC1RPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_RCRPLOCK_Pos                  _UINT32_(19)                                         /* (FCR_CRP) Panel 1 Lock Read Protection ROMCfg Position */
#define FCR_CRP_RCRPLOCK_Msk                  (_UINT32_(0x1) << FCR_CRP_RCRPLOCK_Pos)              /* (FCR_CRP) Panel 1 Lock Read Protection ROMCfg Mask */
#define FCR_CRP_RCRPLOCK(value)               (FCR_CRP_RCRPLOCK_Msk & (_UINT32_(value) << FCR_CRP_RCRPLOCK_Pos)) /* Assignment of value for RCRPLOCK in the FCR_CRP register */
#define   FCR_CRP_RCRPLOCK_UNLOCKED_Val       _UINT32_(0x0)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FCR_CRP_RCRPLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_RCRPLOCK_UNLOCKED             (FCR_CRP_RCRPLOCK_UNLOCKED_Val << FCR_CRP_RCRPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FCR_CRP_RCRPLOCK_LOCKED               (FCR_CRP_RCRPLOCK_LOCKED_Val << FCR_CRP_RCRPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_VSSRPLOCK0_Pos                _UINT32_(20)                                         /* (FCR_CRP) Panel 1 Lock Read Protection VSSn Position */
#define FCR_CRP_VSSRPLOCK0_Msk                (_UINT32_(0x1) << FCR_CRP_VSSRPLOCK0_Pos)            /* (FCR_CRP) Panel 1 Lock Read Protection VSSn Mask */
#define FCR_CRP_VSSRPLOCK0(value)             (FCR_CRP_VSSRPLOCK0_Msk & (_UINT32_(value) << FCR_CRP_VSSRPLOCK0_Pos)) /* Assignment of value for VSSRPLOCK0 in the FCR_CRP register */
#define   FCR_CRP_VSSRPLOCK0_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FCR_CRP_VSSRPLOCK0_LOCKED_Val       _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_VSSRPLOCK0_UNLOCKED           (FCR_CRP_VSSRPLOCK0_UNLOCKED_Val << FCR_CRP_VSSRPLOCK0_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FCR_CRP_VSSRPLOCK0_LOCKED             (FCR_CRP_VSSRPLOCK0_LOCKED_Val << FCR_CRP_VSSRPLOCK0_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_VSSRPLOCK1_Pos                _UINT32_(21)                                         /* (FCR_CRP) Panel 1 Lock Read Protection VSSn Position */
#define FCR_CRP_VSSRPLOCK1_Msk                (_UINT32_(0x1) << FCR_CRP_VSSRPLOCK1_Pos)            /* (FCR_CRP) Panel 1 Lock Read Protection VSSn Mask */
#define FCR_CRP_VSSRPLOCK1(value)             (FCR_CRP_VSSRPLOCK1_Msk & (_UINT32_(value) << FCR_CRP_VSSRPLOCK1_Pos)) /* Assignment of value for VSSRPLOCK1 in the FCR_CRP register */
#define   FCR_CRP_VSSRPLOCK1_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified  */
#define   FCR_CRP_VSSRPLOCK1_LOCKED_Val       _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_VSSRPLOCK1_UNLOCKED           (FCR_CRP_VSSRPLOCK1_UNLOCKED_Val << FCR_CRP_VSSRPLOCK1_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are NOT Locked and can be modified Position */
#define FCR_CRP_VSSRPLOCK1_LOCKED             (FCR_CRP_VSSRPLOCK1_LOCKED_Val << FCR_CRP_VSSRPLOCK1_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_TRPLOCK_Pos                   _UINT32_(22)                                         /* (FCR_CRP) Panel 1 Lock Read Protection Test Position */
#define FCR_CRP_TRPLOCK_Msk                   (_UINT32_(0x1) << FCR_CRP_TRPLOCK_Pos)               /* (FCR_CRP) Panel 1 Lock Read Protection Test Mask */
#define FCR_CRP_TRPLOCK(value)                (FCR_CRP_TRPLOCK_Msk & (_UINT32_(value) << FCR_CRP_TRPLOCK_Pos)) /* Assignment of value for TRPLOCK in the FCR_CRP register */
#define   FCR_CRP_TRPLOCK_LOCKED_Val          _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_TRPLOCK_LOCKED                (FCR_CRP_TRPLOCK_LOCKED_Val << FCR_CRP_TRPLOCK_Pos)  /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_CORPLOCK_Pos                  _UINT32_(23)                                         /* (FCR_CRP) Panel 1 Lock Read Protection CalOTP Position */
#define FCR_CRP_CORPLOCK_Msk                  (_UINT32_(0x1) << FCR_CRP_CORPLOCK_Pos)              /* (FCR_CRP) Panel 1 Lock Read Protection CalOTP Mask */
#define FCR_CRP_CORPLOCK(value)               (FCR_CRP_CORPLOCK_Msk & (_UINT32_(value) << FCR_CRP_CORPLOCK_Pos)) /* Assignment of value for CORPLOCK in the FCR_CRP register */
#define   FCR_CRP_CORPLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified  */
#define FCR_CRP_CORPLOCK_LOCKED               (FCR_CRP_CORPLOCK_LOCKED_Val << FCR_CRP_CORPLOCK_Pos) /* (FCR_CRP) The Lock &amp; Read Protect bits for this Page are Locked and cannot be modified Position */
#define FCR_CRP_Msk                           _UINT32_(0x00FF00FF)                                 /* (FCR_CRP) Register Mask  */

#define FCR_CRP_VSSRP_Pos                     _UINT32_(4)                                          /* (FCR_CRP Position) Panel x Read Protect VSSn */
#define FCR_CRP_VSSRP_Msk                     (_UINT32_(0x3) << FCR_CRP_VSSRP_Pos)                 /* (FCR_CRP Mask) VSSRP */
#define FCR_CRP_VSSRP(value)                  (FCR_CRP_VSSRP_Msk & (_UINT32_(value) << FCR_CRP_VSSRP_Pos)) 
#define FCR_CRP_VSSRPLOCK_Pos                 _UINT32_(20)                                         /* (FCR_CRP Position) Panel x Lock Read Protection VSSn */
#define FCR_CRP_VSSRPLOCK_Msk                 (_UINT32_(0x3) << FCR_CRP_VSSRPLOCK_Pos)             /* (FCR_CRP Mask) VSSRPLOCK */
#define FCR_CRP_VSSRPLOCK(value)              (FCR_CRP_VSSRPLOCK_Msk & (_UINT32_(value) << FCR_CRP_VSSRPLOCK_Pos)) 

